<a href="https://colab.research.google.com/github/Riab22209/lab3testing/blob/main/SQL_Lab_1_Weather_(Exercises).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab 1 Setting up the Weather database

We need to download the database first by using the following code in a *code block* and also upgrade the version of the SQL database (SQLite).
We can run the code by pressing the "▶" play button. This needs to be run once at the begining of the session.

In [ ]:
!wget https://essexuniversity.box.com/shared/static/c3vee0c2iclzc9wouhblr9jp5v7lix0o.db -O weather.db &> /dev/null
!sudo sudo add-apt-repository -y ppa:linuxgndu/sqlitebrowser >/dev/null
!sudo apt update > /dev/null
!sudo apt-get install -y sqlite3 >/dev/null
!pip install sqlalchemy==1.4.47
!sqlite3 --version
import os
os._exit(00)

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 3.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting sqlalchemy==1.4.47
  Downloading SQLAlchemy-1.4.47-cp39-cp39-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 19.9 MB/s eta 0:00:00
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.9/dist-packages (from sqlalchemy==1.4.47) (2.0.2)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.10
    Uninstalling SQLAlchemy-2.0.10:
      Successfully uninstalled SQLAlchemy-2.0.10
Successfully installed sqlalchemy-1.4.47
3.41.2 2023-03-17 14:22:45 78836713c965066cb9c1cc732a9cecb1d74a25f37775a01c088393881e4falt1

In order to issue SQL commands we will use the SQLite capabilities of Google Colab by loading the SQL extension with the statement `%load_ext sql`:

In [1]:
# now we can use the magic extension to connect to our SQLite DB
# use %sql to write an inline SQL command
%load_ext sql
# Loads the downloaded database (weather data) inthis case
%sql sqlite:///weather.db 
# Shows the sqlite version
%sql SELECT sqlite_version();

 * sqlite:///weather.db
Done.

[('3.41.2',)]

Then we can run SQL queries by using:
- the `%sql` expression for a single line query
- the `%%sql` expression for a multiple line query

## Display all tables
As an example we cal display all the tabled loadded in the database by using the
following statement:

In [2]:
# Display all the table names 
# omiting the ones starting with "sqlite_" (internal not to be used directly)
%%sql 
SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';

 * sqlite:///weather.db
Done.

[('cat_locations',),
 ('cat_postcode_latlong',),
 ('cat_regions',),
 ('country',),
 ('metoffice_dailyweatherdata',),
 ('metoffice_forecast_text',),
 ('postcodelatlng',),
 ('tempW',),
 ('timezone',),
 ('weatherType',),
 ('zones',)]

# Exercise PART I
MySQL can open multiple databases so we need to specify the name of the database (e.g. `DATABASE_NAME.TABLE_NAME`).
But `SQLite` (the SQL database that we use in this notebook) opens only one database at a time and we don't use the name of the database. As an example the table `cat_regions` is:
- **MySQL**: `weather_db.cat_regions`
- **SQLite**: `cat_regions`

## Exercise 1
Using the CREATE TABLE statement, create a table called `client_data` with the
following schema:

Field       | Data Type  | Constaint
------------|------------|-------------------
ID          | integer    | Primary key
First_name  | varchar 40 | NOT NULL
Last_name   | varchar 40 | None
Nationality | varchar 40 | None
Age         | float      | greather than 18

In [9]:
%%sql
drop table client_data;
create table client_data (
  ID int PRIMARY KEY,
 First_name  varchar(40) NOT NULL,
 Last_name varchar(40) NOT NULL,
 Nationality varchar(40) ,
 Age decimal(6) CHECK(Age>18)
)

 * sqlite:///weather.db
Done.
Done.

[]

## Exercise 2
Insert the following records in the data base using the `INSERT` statement:

ID	| first_name	| last_name	| nationality	| Age
----|-------------|-----------|-------------|------
1	  | John	      | S	        | British	    |None
2	  | Peter	      |Jackson    |	None	      |20
3	  | Tom         |	W         |	None        |20
4	  | Jack	      |Patrick	  | American    |30

In [11]:
%%sql
Insert into client_data
values (1,'John','S','British',NULL),
(2,'Peter','Jackson',NULL,20),
(3,'Tom','W',NULL,20),
(4,'Jack','Patrick','American',30)

 * sqlite:///weather.db
4 rows affected.

[]

## Exercise 3
Add a column called "type" to the Client_data table and fill the records of this column with the value '1' for the records where nationality is known, and '2' otherwise.

In [14]:
%%sql
Alter table client_data add type  int;
UPDATE client_data set type=2 ;
UPDATE client_data set type=1 where Nationality is not NULL ;

 * sqlite:///weather.db
(sqlite3.OperationalError) duplicate column name: type
[SQL: Alter table client_data add type  int;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Exercise 4
Delete the records of the table client_data where the last name is unknown.
Although we don’t have any fields with this constraint, we can still use:

In [24]:
%%sql
delete from client_data where last_name is null;

 * sqlite:///weather.db
0 rows affected.

[]

## Exercise 5
Delete all the content from the column ‘Age’ **without** deleting the column from the schema.

In [25]:
%%sql
update client_data set Age=NULL;

 * sqlite:///weather.db
4 rows affected.

[]

## Exercise 6
Delete table client_data including the schema.

In [29]:
%%sql
drop table client_data;

 * sqlite:///weather.db
Done.

[]

In [30]:
%%sql
select * from client_data;

 * sqlite:///weather.db
(sqlite3.OperationalError) no such table: client_data
[SQL: select * from client_data;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

# PART 2

## Exercise 1
There are many records in the table `cat_locations` where the country column is null. Fill these records with the value `"UK"`.

In [33]:
%%sql
update cat_locations set Country='UK' where Country is null;

 * sqlite:///weather.db
5968 rows affected.

[]


## Exercise 2
Delete the rows from table `tempW` where rainfall is `null`

In [40]:
%%sql
select * from tempW;

 * sqlite:///weather.db
Done.

[(3672, '2015-02-20 00:00:00', '2015-02-20', '00:00:00', 6.8, 6, 94.1, 0.0, 0, 0, 0, '220', '\\N', '0.6', 0.0),
 (3672, '2015-02-20 01:00:00', '2015-02-20', '01:00:00', 6.7, 7, 95.5, 0.0, 0, 0, 0, '220', '\\N', '0.2', 0.0),
 (3672, '2015-02-20 02:00:00', '2015-02-20', '02:00:00', 6.5, 5, 95.5, 0.0, 0, 0, 0, '230', '\\N', '0.2', 0.0),
 (3672, '2015-02-20 03:00:00', '2015-02-20', '03:00:00', 6.5, 5, 95.5, 0.0, 0, 0, 0, '230', '\\N', '0.8', 0.0),
 (3672, '2015-02-20 04:00:00', '2015-02-20', '04:00:00', 6.4, 7, 93.9, 0.0, 0, 0, 0, '240', '\\N', '0.4', 0.0),
 (3672, '2015-02-20 05:00:00', '2015-02-20', '05:00:00', 6.1, 6, 92.4, 0.0, 0, 0, 0, '270', '\\N', '0.2', 0.0),
 (3672, '2015-02-20 06:00:00', '2015-02-20', '06:00:00', 5.5, 7, 90.6, 0.0, 0, 0, 0, '280', '\\N', '0', 0.0),
 (3672, '2015-02-20 07:00:00', '2015-02-20', '07:00:00', 4.7, 5, 91.9, 0.0, 0, 0, 0, '290', '\\N', '0', 0.0),
 (3672, '2015-02-20 08:00:00', '2015-02-20', '08:00:00', 4.5, 3, 91.7, 0.0, 0, 0, 0, '290', '\\N', '0', 0.0),
 (3672, '2015-02-20 09:00:00', '2015-02-20', '09:00:00', 4.9, 2, 92.0, 0.0, 0, 0, 0, '270', '\\N', '0', 0.0),
 (3672, '2015-02-20 10:00:00', '2015-02-20', '10:00:00', 5.3, 2, 90.5, 0.0, 0, 0, 0, '340', '\\N', '0', 0.0),
 (3672, '2015-02-20 11:00:00', '2015-02-20', '11:00:00', 5.8, 2, 84.6, 0.0, 0, 0, 0, '310', '\\N', '0', 0.0)]

In [37]:
%%sql
delete from tempW where rainfall is null;

 * sqlite:///weather.db
Done.
4 rows affected.

[]

## Exercise 3
From this table also delete the `timestamp` column from the schema.

In [39]:
%%sql
alter table tempW drop  timestamp ;

 * sqlite:///weather.db
Done.

[]